var priceList = {
	"001" : {"id" : "001", "subid" : {}, "name" : "Какао-бобы, 100г", "price" : "640"},
	"002" : {"id" : "002", "subid" : {}, "name" : "Эраконд, 150 мл", "price" : "2500"},
	"003" : {"id" : "003", "subid" : {}, "name" : "Мыло Эраконд, 90 г", "price" : "1300"},
	"004" : {"id" : "004", "subid" : {}, "name" : "Гель для душа, 270 мл", "price" : "900"},
	"005" : {"id" : "005", "subid" : {}, "name" : "Туалетная вода,73 мл", "price" : "640"},
	"006" : {"id" : "006", "subid" : {}, "name" : "Витамин Е, 1 г*50 шт", "price" : "2599"},
	"007" : {"id" : "007", "subid" : {}, "name" : "Кератин космет, 9 мл", "price" : "300"},
	"008" : {"id" : "008", "subid" : {}, "name" : "Бьюти Комплекс,80 шт", "price" : "1960"},
	"009" : {"id" : "009", "subid" : {}, "name" : "Лонгавита, 14 шт, 6 УП", "price" : "8400"},
	"010" : {"id" : "010", "subid" : {}, "name" : "Биовита, 0,6 л.*12 шт.", "price" : "315"},
	"011" : {"id" : "011", "subid" : {}, "name" : "Египетский чай, 300 г.", "price" : "200"},
	"012" : {"id" : "012", "subid" : {}, "name" : "Финики Ширин, 200/500г.", "price" : "1395"},
	"013" : {"id" : "013", "subid" : {}, "name" : "Кинезис (мазь), 50 мл", "price" : "800"},
	"014" : {"id" : "014", "subid" : {}, "name" : "Пудра минеральная,8г.", "price" : "770"},
	"015" : {"id" : "015", "subid" : {}, "name" : "Стимэрект, 20 капс.", "price" : "1999"},
	"016" : {"id" : "016", "subid" : {}, "name" : "Сильвер гель,44 мл.", "price" : "872"},
	"017" : {"id" : "017", "subid" : {}, "name" : "Пантолекс, капсулы №20", "price" : "960"},
	"018" : {"id" : "018", "subid" : {}, "name" : "Пантолекс гель, 75 мл", "price" : "500"},
	"019" : {"id" : "019", "subid" : {}, "name" : "Детский СПОРТ", "price" : "4812"},
	"020" : {"id" : "020", "subid" : {}, "name" : "Пантолекс, Белковый коктейль", "price" : "1586"},
	"021" : {"id" : "021", "subid" : {}, "name" : "Пантолекс, Крем-масло лиственницай, 100 мл", "price" : "1248"},
	"022" : {"id" : "022", "subid" : {}, "name" : "Пантолекс, Balance Kit (растительный комплекс)", "price" : "5708"},
	"023" : {"id" : "023", "subid" : {}, "name" : "Пантолекс, Противити ", "price" : "2706"},
	"024" : {"id" : "024", "subid" : {}, "name" : "Пантовые ванны Пантоника,150мл", "price" : "690"},
	"025" : {"id" : "025", "subid" : {}, "name" : "Фитнес-браслет BQ W008", "price" : "1603"},
	"026" : {"id" : "026", "subid" : {}, "name" : "GymBit «Идеальный пресс».", "price" : "1499"},
	"027" : {"id" : "027", "subid" : {}, "name" : "Турник в дверной проём ", "price" : "650"},
	"028" : {"id" : "028", "subid" : {}, "name" : "Гантель разборная «Атлант»", "price" : "500"},
	"029" : {"id" : "029", "subid" : {}, "name" : "Комплект из овечьей шерсти «Здоровье»", "price" : "950"},
	"030" : {"id" : "030", "subid" : {}, "name" : "Суппортер запястья Larsen 8101", "price" : "220"},
	"031" : {"id" : "031", "subid" : {}, "name" : "Гриф для штанги Larsen", "price" : "1938"},
	"032" : {"id" : "032", "subid" : {}, "name" : "Дорожка беговая магнитная", "price" : "12 110"},
	"033" : {"id" : "033", "subid" : {}, "name" : "Массажер для тела Bradex «Релакс»", "price" : "1760"},
	"034" : {"id" : "034", "subid" : {}, "name" : "Подушка Dormeo RELAX", "price" : "599"},
	"035" : {"id" : "035", "subid" : {}, "name" : "Пояс фиксированный Miss Belt", "price" : "1210"},
	"036" : {"id" : "036", "subid" : {}, "name" : "Фиксатор межпальцевый двойной", "price" : "499"},
	"037" : {"id" : "037", "subid" : {}, "name" : "Крем-мазь ЛЕКАРЬ , 50 мл", "price" : "218"},
	"038" : {"id" : "038", "subid" : {}, "name" : "Зелёная глина, кусковая", "price" : "250"},
	"039" : {"id" : "039", "subid" : {}, "name" : "Голубая глина, кусковая", "price" : "250"},
	"040" : {"id" : "040", "subid" : {}, "name" : "Пантовые ванны Пантоника,150мл.", "price" : "690"},
	"041" : {"id" : "041", "subid" : {}, "name" : "Магний, 802 мг.*90 капс", "price" : "1102"},
	"042" : {"id" : "042", "subid" : {}, "name" : "Кальций меджик,120шт", "price" : "1225"},
	"043" : {"id" : "043", "subid" : {}, "name" : "Лецитин, 120капс", "price" : "1102"},
	"044" : {"id" : "044", "subid" : {}, "name" : "Омега 3-6-9, 60капс", "price" : "1058"},
	"045" : {"id" : "045", "subid" : {}, "name" : "Жир печени акулы, 60 капс.*570 мг", "price" : "1176"},
	"046" : {"id" : "046", "subid" : {}, "name" : "Батончик Лёгкий перекус, 45г", "price" : "720"},
	"047" : {"id" : "047", "subid" : {}, "name" : "Мед АКАЦИИ, алтайский, 500г", "price" : "1580"},
	"048" : {"id" : "048", "subid" : {}, "name" : "Травы с морской солью, 400 г", "price" : "1363"},
	};

var cart;
var config;
var wiNumInputPrefID;
$(document).ready(function(){  
    cart = new WICard("cart");
    config = {'clearAfterSend':true, 'showAfterAdd':false};
    
    cart.init("basketwidjet", config);
    
    
});	
document.addEventListener('visibilitychange', function(e) {
cart.init("basketwidjet", config);
}, false);

